Hello here it is the output
```
  # ibm_mqcloud_user.user["user-1"] will be created
+ resource "ibm_mqcloud_user" "user" {
+ email                 = "user-1@example.com"
+ href                  = (known after apply)
+ id                    = (known after apply)
+ name                  = "user-1"
+ service_instance_guid = ""
+ user_id               = (known after apply)
}

Plan: 1 to add, 0 to change, 0 to destroy.
 ibm_mqcloud_user.user["user-1"]: Creating...

Error: ---
id: terraform-91c0b71c
summary: 'CreateUserWithContext failed: Bad request'
 severity: error
 resource: ibm_mqcloud_user
operation: create
component:
name: github.com/IBM-Cloud/terraform-provider-ibm
version: 1.81.1
```